export const questionsData = [
  {
    id: 1,
    taxt: "شناسه کالا/خدمت چیست؟ از چه مرجعی قابل دریافت است؟",
    paraph: `شناسه کالا/خدمت یک شماره 13 رقمی است که به کالا/خدمت تخصیص داده می‌شود. 
        به ازای هر ردیف در صورتحساب الکترونیک صادره توسط مؤدیان، درج شناسه کالا/خدمت الزامی است.  کلیه تولیدکنندگان، 
        واردکنندگان، بازرگانان و ارائه دهندگان خدمت مکلف به دریافت شناسه مذکور از وزارت صنعت، معدن و تجارت هستند.همچنین کلیه
         شناسه‌های کالا/ خدمت تخصیص داده‌شده، از طریق نشانی Stuffid.tax.gov.ir قابل دریافت است.برای دریافت شناسه کالا / خدمت می‌توان از طریق نمایندگی‌های مرکز ملی شماره‌گذاری کالا و خدمات که
         لیست اسامی و مشخصات تماس آن‌ها در آدرس <a href='https://www.irancode.ir/CMS/Colleagues/Colleagues'>https://www.irancode.ir/CMS/Colleagues/Colleagues</a>  ارائه شده است اقدام کنید`,
  },
  {
    id: 2,
    taxt: "درصورتی که به هر دلیل امکان اخذ شناسه کالا/خدمت برای مؤدیان فراهم نباشد، چه راهکاری در نظر گرفته شده است؟",
    paraph: `شناسه کالا/خدمت قابل پذیرش از سوی سامانه مودیان در درگاه  stuffid.tax.gov.ir ارائه شده است. کلیه تولیدکنندگان، واردکنندگان و ارائه‌دهندگان
             خدمت مکلف به
             دریافت شناسه مذکور از وزارت صنعت، معدن و تجارت بوده
             و مادامی که شناسه کالا/ خدمت اختصاصی برای کالاها و خدمات مورد نظر فراهم نشده باشد
              یا در درگاه بیان شده درج نشده است، می‌توانند از شناسه کالا/خدمت عمومی برای صدور صورتحساب الکترونیکی استفاده نمایند.`,
  },
  {
    id: 3,
    taxt: "مؤدیانی که کلیه تکالیف قانونی خود را انجام می‌دهند، آیا الزامی به ارسال اطلاعات معاملات فصلی موضوع ماده  169دارند؟",
    paraph: `طبق مقررات ماده (7) قانون پایانه‌های فروشگاهی و سامانه مودیان، ارسال صورتحساب‌های الکترونیکی به سامانه مودیان به منزله ثبت آن 
            در سامانه فهرست معاملات موضوع ماده (169) قانون مالیات‌های مستقیم بوده و فروشنده و خریدار تکلیف اضافی در این خصوص نخواهند داشت. بدیهی
             است مودیان مکلفند بابت کلیه معاملات خود که در سامانه مودیان درج نمی‌شود، مقررات ماده(169) قانون مالیات‌های مستقیم را در ارائه آمار معاملات فصلی ظرف مهلت مقرر، رعایت نمایند.`,
  },
  {
    id: 4,
    taxt: "روش ارسال صورتحساب الکترونیکی توسط سامانه دیبا در کدام دسته از روش‌های ارسال قرار می‌گیرد؟",
    paraph: `سامانه پایانه فروشگاهی دیبا به دو روش می‌تواند صورتحساب‌های الکترونیک مؤدیان را به کارپوشه آن‌ها در سامانه مؤدیان ارسال نماید.
            روش اول: مؤدیان می‌توانند صورتحساب‌های خود را در بستر رابط کاربری سامانه مذکور ثبت نموده و دیبا صورتحساب‌ها را از طریق کلید مؤدی با روش ارسال مستقیم به کارپوشه سامانه مؤدیان ارسال نماید.
            روش دوم: اگر مؤدیان با شرکت‌های معتمد همکاری نموده و قصد ارسال صورتحساب‌های الکترونیک خود را از طریق شرکت معتمد دارند
            ، سامانه دیبا می‌تواند صورتحساب‌های مؤدیان را به قالب‌های ارسالی شرکت‌های معتمد تبدیل کرده و در اختیار شرکت معتمد طرف قرارداد مودی قرار دهد.
            `,
  },
  {
    id: 5,
    taxt: "در روش ارسال مستقیم صورتحساب از طریق سامانه دیبا چه نیازمندی‌هایی وجود دارد؟",
    paraph: `در گام اول، مؤدیان باید از بخش ثبت‌نام، نسبت به ایجاد نام کاربری و رمز عبور خود و تکمیل سایر اطلاعات مرتبط اقدام نمایند.
             در گام بعدی، سامانه دیبا کلید خصوصی و عمومی مؤدیان را تولید و در اختیار آن‌ها قرار می‌دهد.
              در این مرحله مؤدیان می‌بایست نسبت به دریافت شناسه یکتای حافظه مالیاتی با روش ارسال مستقیم اقدام نموده و کلید عمومی خود
              را در کارپوشه مؤدیان بارگذاری نمایند. سپس شناسه یکتای حافظه مالیاتی دریافت‌شده را در بخش «مشخصات مالیاتی» در سامانه دیبا درج نمایند.`,
  },
];
